In [8]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np
import sklearn.preprocessing
from sklearn.preprocessing import StandardScaler, RobustScaler
import matplotlib.pyplot as plt

In [2]:
df=pd.DataFrame(np.random.randn(5,3),
               columns=['c1','c2','c3'])

In [3]:
df

         c1        c2        c3
0 -0.135866  0.163585 -1.571617
1  0.288336 -0.264973 -3.143145
2 -0.977667  0.430021 -1.099059
3  1.018299  0.727402  0.216412
4  0.191871 -0.350573  0.198597

In [16]:
dfdate=['07/3/2019','07/4/2019','07/5/2019','07/10/2019']
dfdate
myDate=pd.to_datetime(dfdate)
myDate

DatetimeIndex(['2019-07-03', '2019-07-04', '2019-07-05', '2019-07-10'], dtype='datetime64[ns]', freq=None)

In [17]:
times=Series([1,np.nan, np.nan ,20], index=myDate)
times

2019-07-03     1.0
2019-07-04     NaN
2019-07-05     NaN
2019-07-10    20.0
dtype: float64

In [18]:
#보간법(interpolate)
ti=times.interpolate()
ti

2019-07-03     1.000000
2019-07-04     7.333333
2019-07-05    13.666667
2019-07-10    20.000000
dtype: float64

In [19]:
times.interpolate(method="time")

2019-07-03     1.000000
2019-07-04     3.714286
2019-07-05     6.428571
2019-07-10    20.000000
dtype: float64

In [23]:
df=DataFrame({'c1':[1,2,np.nan,np.nan,5],
           'c2':[6,8,10,np.nan,20]})
df

    c1    c2
0  1.0   6.0
1  2.0   8.0
2  NaN  10.0
3  NaN   NaN
4  5.0  20.0

In [24]:
df.interpolate(method='values')

    c1    c2
0  1.0   6.0
1  2.0   8.0
2  3.0  10.0
3  4.0  15.0
4  5.0  20.0

In [25]:
df.interpolate(method='values', limit=1)

    c1    c2
0  1.0   6.0
1  2.0   8.0
2  3.0  10.0
3  NaN  15.0
4  5.0  20.0

In [26]:
df.interpolate(method='values', limit=1, limit_direction='backward')

    c1    c2
0  1.0   6.0
1  2.0   8.0
2  NaN  10.0
3  4.0  15.0
4  5.0  20.0

In [27]:
s=Series([1,2,3,4,np.nan])
s

0    1.0
1    2.0
2    3.0
3    4.0
4    NaN
dtype: float64

In [29]:
s.replace(np.nan, 10)
s.replace(3,100)

0      1.0
1      2.0
2    100.0
3      4.0
4      NaN
dtype: float64

In [32]:
s.replace([1,2,3], [5,6,7])
s.replace({1:10, np.nan:999})

0     10.0
1      2.0
2      3.0
3      4.0
4    999.0
dtype: float64

In [35]:
df=pd.DataFrame({'k1':['a','b','b','c','c'],
             'k2':['v','w','w','x','y'],
             'c':[1,2,3,4,5]})
df
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
k1    5 non-null object
k2    5 non-null object
c     5 non-null int64
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [37]:
df.duplicated(['k1'])
df.duplicated(['k1','k2'])

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [41]:
df.duplicated(['k1'])
df.duplicated(['k1'], keep='first') #default
df.duplicated(['k1'], keep='last')
df.duplicated(['k1'], keep=False)

0    False
1     True
2     True
3     True
4     True
dtype: bool

In [48]:
df.drop_duplicates(['k1'])
df.drop_duplicates(['k1'],keep='first') #default
df.drop_duplicates(['k1'],keep='last') 
df.drop_duplicates(['k1'],keep=False) 
#df

  k1 k2  c
0  a  v  1

In [54]:
df=pd.DataFrame({
    's':['f','m','m','f','m'],
    'd':['a','a','a','a',np.nan],
    'c':[1,1,3,4,4]})
#df
#df.info()
df['s'].unique()
df['d'].unique()

array(['a', nan], dtype=object)

In [63]:
df['s'].value_counts()
#df:붕어빵, df['s']:자동차, value_counts():달린다
#df.value_counts()는 말이 안됨
#df['s'].value_counts()는 말이 됨

df['d'].value_counts() #Nan은 안나옴

a    4
Name: d, dtype: int64

In [64]:
df['s'].value_counts(normalize=True)

m    0.6
f    0.4
Name: s, dtype: float64

In [65]:
df['c']

0    1
1    1
2    3
3    4
4    4
Name: c, dtype: int64

In [68]:
df['c'].value_counts(sort=True) #default:내림차순 정렬
df['c'].value_counts(sort=True, ascending=False) 
df['c'].value_counts(sort=True, ascending=True)

3    1
1    2
4    2
Name: c, dtype: int64

In [72]:
df['d'].value_counts(dropna=True) #default
df['d'].value_counts(dropna=False)

a      4
NaN    1
Name: d, dtype: int64

In [ ]:
#오후 연습 문제
#캐글->타이타닉->호칭->호칭별 건수->소트->상위 10개호칭 조사
#나이(age)->구간화->구간별 건수 ->소트 출력

In [73]:
df

   s    d  c
0  f    a  1
1  m    a  1
2  m    a  3
3  f    a  4
4  m  NaN  4